Now letâ€™s practice creating and running some SQL queries in the SQL editor.

Consider the following table called INSTRUCTOR:

Task 0: Drop the table INSTRUCTOR from the database in case it already exists, so that we start from a clean state.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime

%matplotlib inline
sns.set_style('dark')
sns.set(font_scale=1.2)

import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.max_columns',None)
pd.set_option('display.max_rows',None)

Task 1: Create the INSTRUCTOR table as defined above. Have the ins_id be the primary key, and ensure the lastname and firstname are not null.

In [2]:
d = {'ins_id': [], 'lastname': [], 'firstname': [], 'city': [],'country': []}

In [3]:
df = pd.DataFrame(data=d)

In [4]:
df

Empty DataFrame
Columns: [ins_id, lastname, firstname, city, country]
Index: []

Task 2A: Insert one row into the INSTRUCTOR table for the the instructor Rav Ahuja.

In [5]:
row1 = {'ins_id': 1, 'lastname': 'Ahuja', 'firstname': 'Rav', 'city': 'Toronto','country': 'CA'}

In [6]:
df = df.append(row1,ignore_index=True)

In [7]:
df

   ins_id lastname firstname     city country
0     1.0    Ahuja       Rav  Toronto      CA

Task 2B: Insert two rows at once in the INSTRUCTOR table for instructors Raul Chong and Hima Vasudevan.

In [8]:
data2 = {'ins_id':[2,3], 'lastname': ['Chong','Vasudevan'], 'firstname': ['Raul','Hima'], 
        'city': ['Toronto','Chicago'],'country': ['CA','US']}

In [9]:
df2 = pd.DataFrame(data=data2)

In [10]:
df2

   ins_id   lastname firstname     city country
0       2      Chong      Raul  Toronto      CA
1       3  Vasudevan      Hima  Chicago      US

In [11]:
df = pd.concat([df,df2],axis=0,ignore_index=True)

In [12]:
df

   ins_id   lastname firstname     city country
0     1.0      Ahuja       Rav  Toronto      CA
1     2.0      Chong      Raul  Toronto      CA
2     3.0  Vasudevan      Hima  Chicago      US

Task 3: Select all rows from the INSTRUCTOR table.

In [13]:
df.loc[:,]

   ins_id   lastname firstname     city country
0     1.0      Ahuja       Rav  Toronto      CA
1     2.0      Chong      Raul  Toronto      CA
2     3.0  Vasudevan      Hima  Chicago      US

Task 3B: Select the firstname, lastname and country where the city is Toronto

In [14]:
df[df['city'] == 'Toronto']

   ins_id lastname firstname     city country
0     1.0    Ahuja       Rav  Toronto      CA
1     2.0    Chong      Raul  Toronto      CA

Task 4: Update the row for Rav Ahuja and change his city to Markham.

In [15]:
df.iloc[0]

ins_id             1
lastname       Ahuja
firstname        Rav
city         Toronto
country           CA
Name: 0, dtype: object

In [16]:
df.loc[:,'city'][0]

'Toronto'

In [17]:
df.loc[:,'city'][0] = 'Markham'

In [18]:
df

   ins_id   lastname firstname     city country
0     1.0      Ahuja       Rav  Markham      CA
1     2.0      Chong      Raul  Toronto      CA
2     3.0  Vasudevan      Hima  Chicago      US

Task 5: Delete the row for Raul Chong from the table

In [19]:
df.drop(index=1, inplace=True)

In [20]:
df

   ins_id   lastname firstname     city country
0     1.0      Ahuja       Rav  Markham      CA
2     3.0  Vasudevan      Hima  Chicago      US

Task 5B: Retrieve all rows in the INSTRUCTOR table

In [21]:
df.reset_index(drop=True,inplace=True)

In [22]:
df

   ins_id   lastname firstname     city country
0     1.0      Ahuja       Rav  Markham      CA
1     3.0  Vasudevan      Hima  Chicago      US